In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and set up
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
# Files to load and read
city_data_df = pd.read_csv("Resources/city_data.csv")
ride_data_df = pd.read_csv("Resources/ride_data.csv")

In [4]:
city_data_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [5]:
ride_data_df.head()

                 city           date   fare       ride_id
0  Lake Jonathanshire  1/14/19 10:14  13.83  5.740000e+12
1  South Michelleport   3/4/19 18:24  30.24  2.340000e+12
2  Port Samanthamouth   2/24/19 4:29  33.44  2.010000e+12
3          Rodneyfort  2/10/19 23:22  23.44  5.150000e+12
4          South Jack    3/6/19 4:28  34.58  3.910000e+12

In [6]:
# Get the columns and rows that are not null
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [8]:
# Get the data types
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [10]:
# Get the unique values of the type of city
city_data_df['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [11]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")

66

In [12]:
sum(city_data_df["type"]=="Suburban")

36

In [13]:
sum(city_data_df["type"]=="Rural")

18

In [14]:
# Get the columns and the rows that are not null.
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [15]:
# Get the data types of each column.
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id    float64
dtype: object

In [18]:
# Merge the data frames into a single data frame
pyber_data_df = pd.merge(ride_data_df, city_data_df, how = 'left', on = ['city', 'city'] )

# Display data frame
pyber_data_df.head()

                 city           date   fare       ride_id  driver_count   type
0  Lake Jonathanshire  1/14/19 10:14  13.83  5.740000e+12             5  Urban
1  South Michelleport   3/4/19 18:24  30.24  2.340000e+12            72  Urban
2  Port Samanthamouth   2/24/19 4:29  33.44  2.010000e+12            57  Urban
3          Rodneyfort  2/10/19 23:22  23.44  5.150000e+12            34  Urban
4          South Jack    3/6/19 4:28  34.58  3.910000e+12            46  Urban